const countryCallingCodes = [
  {
    cid: '+86',
    name: '中国大陆',
  },
  {
    cid: '+852',
    name: '中国香港特别行政区',
  },
  {
    cid: '+853',
    name: '中国澳门特别行政区',
  },
  {
    cid: '+886',
    name: '中国台湾',
  },
  {
    cid: '+1',
    name: '美国',
  },
  {
    cid: '+32',
    name: '比利时',
  },
  {
    cid: '+61',
    name: '澳大利亚',
  },
  {
    cid: '+33',
    name: '法国',
  },
  {
    cid: '+1',
    name: '加拿大',
  },
  {
    cid: '+81',
    name: '日本',
  },
  {
    cid: '+65',
    name: '新加坡',
  },
  {
    cid: '+82',
    name: '韩国',
  },
  {
    cid: '+60',
    name: '马来西亚',
  },
  {
    cid: '+44',
    name: '英国',
  },
  {
    cid: '+39',
    name: '意大利',
  },
  {
    cid: '+49',
    name: '德国',
  },
  {
    cid: '+7',
    name: '俄罗斯',
  },
  {
    cid: '+64',
    name: '新西兰',
  },
  {
    cid: '+93',
    name: '阿富汗',
  },
  {
    cid: '+355',
    name: '阿尔巴尼亚',
  },
  {
    cid: '+213',
    name: '阿尔及利亚',
  },
  {
    cid: '+376',
    name: '安道尔',
  },
  {
    cid: '+244',
    name: '安哥拉',
  },
  {
    cid: '+1268',
    name: '安提瓜岛和巴布达',
  },
  {
    cid: '+54',
    name: '阿根廷',
  },
  {
    cid: '+374',
    name: '亚美尼亚',
  },
  {
    cid: '+247',
    name: '阿森松岛',
  },
  {
    cid: '+43',
    name: '奥地利',
  },
  {
    cid: '+994',
    name: '阿塞拜疆',
  },
  {
    cid: '+1242',
    name: '巴哈马群岛',
  },
  {
    cid: '+973',
    name: '巴林',
  },
  {
    cid: '+880',
    name: '孟加拉国',
  },
  {
    cid: '+1246',
    name: '巴巴多斯',
  },
  {
    cid: '+375',
    name: '白俄罗斯',
  },
  {
    cid: '+501',
    name: '伯利兹',
  },
  {
    cid: '+229',
    name: '贝宁',
  },
  {
    cid: '+1441',
    name: '百慕大群岛',
  },
  {
    cid: '+975',
    name: '不丹',
  },
  {
    cid: '+591',
    name: '玻利维亚',
  },
  {
    cid: '+387',
    name: '波黑',
  },
  {
    cid: '+267',
    name: '博茨瓦纳',
  },
  {
    cid: '+55',
    name: '巴西',
  },
  {
    cid: '+673',
    name: '文莱',
  },
  {
    cid: '+359',
    name: '保加利亚',
  },
  {
    cid: '+226',
    name: '布基纳法索',
  },
  {
    cid: '+257',
    name: '布隆迪',
  },
  {
    cid: '+855',
    name: '柬埔寨',
  },
  {
    cid: '+237',
    name: '喀麦隆',
  },
  {
    cid: '+238',
    name: '佛得角',
  },
  {
    cid: '+1345',
    name: '开曼群岛',
  },
  {
    cid: '+236',
    name: '非洲中部',
  },
  {
    cid: '+235',
    name: '乍得',
  },
  {
    cid: '+56',
    name: '智利',
  },
  {
    cid: '+57',
    name: '哥伦比亚',
  },
  {
    cid: '+269',
    name: '科摩罗',
  },
  {
    cid: '+242',
    name: '刚果',
  },
  {
    cid: '+243',
    name: '刚果(金)',
  },
  {
    cid: '+682',
    name: '库克岛',
  },
  {
    cid: '+506',
    name: '哥斯达黎加',
  },
  {
    cid: '+385',
    name: '克罗地亚',
  },
  {
    cid: '+53',
    name: '古巴',
  },
  {
    cid: '+357',
    name: '塞浦路斯',
  },
  {
    cid: '+420',
    name: '捷克',
  },
  {
    cid: '+45',
    name: '丹麦',
  },
  {
    cid: '+246',
    name: '迪戈加西亚岛',
  },
  {
    cid: '+253',
    name: '吉布提',
  },
  {
    cid: '+1767',
    name: '多米尼加',
  },
  {
    cid: '+1809',
    name: '多米尼加代表',
  },
  {
    cid: '+593',
    name: '厄瓜多尔',
  },
  {
    cid: '+20',
    name: '埃及',
  },
  {
    cid: '+503',
    name: '萨尔瓦多',
  },
  {
    cid: '+240',
    name: '赤道几内亚',
  },
  {
    cid: '+291',
    name: '厄立特里亚',
  },
  {
    cid: '+372',
    name: '爱沙尼亚',
  },
  {
    cid: '+251',
    name: '埃塞俄比亚',
  },
  {
    cid: '+500',
    name: '福克兰岛',
  },
  {
    cid: '+298',
    name: '法罗岛',
  },
  {
    cid: '+679',
    name: '斐济',
  },
  {
    cid: '+358',
    name: '芬兰',
  },
  {
    cid: '+594',
    name: '法属圭亚那',
  },
  {
    cid: '+689',
    name: '法属波利尼西亚',
  },
  {
    cid: '+241',
    name: '加蓬',
  },
  {
    cid: '+220',
    name: '冈比亚',
  },
  {
    cid: '+995',
    name: '格鲁吉亚',
  },
  {
    cid: '+233',
    name: '加纳',
  },
  {
    cid: '+350',
    name: '直布罗陀',
  },
  {
    cid: '+30',
    name: '希腊',
  },
  {
    cid: '+299',
    name: '格陵兰岛',
  },
  {
    cid: '+1473',
    name: '格林纳达',
  },
  {
    cid: '+590',
    name: '瓜德罗普岛',
  },
  {
    cid: '+1671',
    name: '关岛',
  },
  {
    cid: '+224',
    name: '几内亚',
  },
  {
    cid: '+245',
    name: '几内亚比绍',
  },
  {
    cid: '+509',
    name: '海地',
  },
  {
    cid: '+504',
    name: '洪都拉斯',
  },
  {
    cid: '+36',
    name: '匈牙利',
  },
  {
    cid: '+354',
    name: '冰岛',
  },
  {
    cid: '+91',
    name: '印度',
  },
  {
    cid: '+62',
    name: '印尼',
  },
  {
    cid: '+98',
    name: '伊朗',
  },
  {
    cid: '+964',
    name: '伊拉克',
  },
  {
    cid: '+353',
    name: '爱尔兰',
  },
  {
    cid: '+972',
    name: '以色列',
  },
  {
    cid: '+225',
    name: '科特迪瓦',
  },
  {
    cid: '+1876',
    name: '牙买加',
  },
  {
    cid: '+962',
    name: '约旦',
  },
  {
    cid: '+254',
    name: '肯尼亚',
  },
  {
    cid: '+686',
    name: '基里巴斯',
  },
  {
    cid: '+850',
    name: '朝鲜',
  },
  {
    cid: '+965',
    name: '科威特',
  },
  {
    cid: '+996',
    name: '吉尔吉斯斯坦',
  },
  {
    cid: '+856',
    name: '老挝',
  },
  {
    cid: '+371',
    name: '拉脱维亚',
  },
  {
    cid: '+961',
    name: '黎巴嫩',
  },
  {
    cid: '+266',
    name: '莱索托',
  },
  {
    cid: '+231',
    name: '利比里亚',
  },
  {
    cid: '+218',
    name: '利比亚',
  },
  {
    cid: '+370',
    name: '立陶宛',
  },
  {
    cid: '+352',
    name: '卢森堡',
  },
  {
    cid: '+389',
    name: '马其顿',
  },
  {
    cid: '+261',
    name: '马达加斯加',
  },
  {
    cid: '+265',
    name: '马拉维',
  },
  {
    cid: '+960',
    name: '马尔代夫',
  },
  {
    cid: '+223',
    name: '马里',
  },
  {
    cid: '+356',
    name: '马耳他',
  },
  {
    cid: '+1670',
    name: '马里亚纳岛',
  },
  {
    cid: '+692',
    name: '马歇尔岛',
  },
  {
    cid: '+596',
    name: '马提尼克岛',
  },
  {
    cid: '+222',
    name: '毛里塔尼亚',
  },
  {
    cid: '+230',
    name: '毛里求斯',
  },
  {
    cid: '+52',
    name: '墨西哥',
  },
  {
    cid: '+691',
    name: '密克罗尼西亚',
  },
  {
    cid: '+373',
    name: '摩尔多瓦',
  },
  {
    cid: '+377',
    name: '摩纳哥',
  },
  {
    cid: '+976',
    name: '蒙古',
  },
  {
    cid: '+1664',
    name: '蒙特塞拉特岛',
  },
  {
    cid: '+212',
    name: '摩洛哥',
  },
  {
    cid: '+258',
    name: '莫桑比克',
  },
  {
    cid: '+95',
    name: '缅甸',
  },
  {
    cid: '+264',
    name: '纳米比亚',
  },
  {
    cid: '+674',
    name: '瑙鲁',
  },
  {
    cid: '+977',
    name: '尼泊尔',
  },
  {
    cid: '+31',
    name: '荷兰',
  },
  {
    cid: '+505',
    name: '尼加拉瓜',
  },
  {
    cid: '+227',
    name: '尼日尔',
  },
  {
    cid: '+234',
    name: '尼日利亚',
  },
  {
    cid: '+683',
    name: '纽埃岛',
  },
  {
    cid: '+672',
    name: '诺福克岛',
  },
  {
    cid: '+47',
    name: '挪威',
  },
  {
    cid: '+968',
    name: '阿曼',
  },
  {
    cid: '+92',
    name: '巴基斯坦',
  },
  {
    cid: '+680',
    name: '帕劳',
  },
  {
    cid: '+507',
    name: '巴拿马',
  },
  {
    cid: '+675',
    name: '巴布亚新几内亚',
  },
  {
    cid: '+595',
    name: '巴拉圭',
  },
  {
    cid: '+51',
    name: '秘鲁',
  },
  {
    cid: '+63',
    name: '菲律宾',
  },
  {
    cid: '+48',
    name: '波兰',
  },
  {
    cid: '+351',
    name: '葡萄牙',
  },
  {
    cid: '+1787',
    name: '波多黎各',
  },
  {
    cid: '+974',
    name: '卡塔尔',
  },
  {
    cid: '+262',
    name: '聚会岛',
  },
  {
    cid: '+40',
    name: '罗马尼亚',
  },
  {
    cid: '+250',
    name: '卢旺达',
  },
  {
    cid: '+684',
    name: '萨摩亚，东部',
  },
  {
    cid: '+685',
    name: '萨摩亚，西部',
  },
  {
    cid: '+378',
    name: '圣马力诺',
  },
  {
    cid: '+239',
    name: '圣多美和普林西比',
  },
  {
    cid: '+966',
    name: '沙特阿拉伯',
  },
  {
    cid: '+221',
    name: '塞内加尔',
  },
  {
    cid: '+248',
    name: '塞舌尔共和国',
  },
  {
    cid: '+232',
    name: '塞拉利昂',
  },
  {
    cid: '+421',
    name: '斯洛伐克',
  },
  {
    cid: '+386',
    name: '斯洛文尼亚',
  },
  {
    cid: '+677',
    name: '所罗门群岛',
  },
  {
    cid: '+252',
    name: '索马里',
  },
  {
    cid: '+27',
    name: '南非',
  },
  {
    cid: '+34',
    name: '西班牙',
  },
  {
    cid: '+94',
    name: '斯里兰卡',
  },
  {
    cid: '+1784',
    name: '圣卢西亚',
  },
  {
    cid: '+508',
    name: '圣皮埃尔和密克隆群岛',
  },
  {
    cid: '+249',
    name: '苏丹',
  },
  {
    cid: '+597',
    name: '苏里南',
  },
  {
    cid: '+268',
    name: '斯威士兰',
  },
  {
    cid: '+46',
    name: '瑞典',
  },
  {
    cid: '+41',
    name: '瑞士',
  },
  {
    cid: '+963',
    name: '叙利亚',
  },
  {
    cid: '+255',
    name: '坦桑尼亚',
  },
  {
    cid: '+66',
    name: '泰国',
  },
  {
    cid: '+228',
    name: '多哥',
  },
  {
    cid: '+690',
    name: '托克劳岛',
  },
  {
    cid: '+676',
    name: '汤加',
  },
  {
    cid: '+1868',
    name: '特立尼达和多巴哥',
  },
  {
    cid: '+216',
    name: '突尼斯',
  },
  {
    cid: '+90',
    name: '土耳其',
  },
  {
    cid: '+993',
    name: '土库曼斯坦',
  },
  {
    cid: '+1649',
    name: '特克斯和凯科斯',
  },
  {
    cid: '+688',
    name: '图瓦卢',
  },
  {
    cid: '+256',
    name: '乌干达',
  },
  {
    cid: '+380',
    name: '乌克兰',
  },
  {
    cid: '+971',
    name: '阿联酋',
  },
  {
    cid: '+598',
    name: '乌拉圭',
  },
  {
    cid: '+998',
    name: '乌兹别克斯坦',
  },
  {
    cid: '+678',
    name: '瓦努阿图',
  },
  {
    cid: '+58',
    name: '委内瑞拉',
  },
  {
    cid: '+84',
    name: '越南',
  },
  {
    cid: '+1284',
    name: '维珍群岛(英属)',
  },
  {
    cid: '+1340',
    name: '维珍群岛(美属)',
  },
  {
    cid: '+1808',
    name: '维克岛',
  },
  {
    cid: '+1681',
    name: '瓦利斯群岛和富图纳群岛',
  },
  {
    cid: '+967',
    name: '也门',
  },
  {
    cid: '+381',
    name: '塞尔维亚',
  },
  {
    cid: '+260',
    name: '赞比亚',
  },
  {
    cid: '+259',
    name: '桑给巴尔岛',
  },
  {
    cid: '+263',
    name: '津巴布韦',
  },
];

export default countryCallingCodes;
